Autodesk.Revit.DB.Domain.DomainStructuralAnalytical
Connector of Structural Analytical Model

Autodesk.Revit.DB.Domain.DomainCableTrayConduit
Connector of cable trays or conduits

Autodesk.Revit.DB.Domain.DomainPiping
Piping connector